<a href="https://colab.research.google.com/github/Rama534-8/python/blob/main/ml.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
data={
    "Name":["sasi","tulasi","nandini","nagamani","sandya","puja"],
    "Age":[21,18,23,38,30,19],
    "City":["india","america","mexico","usa","new york","iran"]
}
df=pd.DataFrame(data)
print(df)

       Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york
5      puja   19      iran

In [ ]:
import pandas as pd
data={
    "Name":["sasi","tulasi","nandini","nagamani","sandya","puja"],
    "Age":[21,18,23,38,30,19],
    "City":["india","america","mexico","usa","new york","iran"]
}
df=pd.DataFrame(data)
print(df.head())

       Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york

In [ ]:
print(df.tail())

       Name  Age      City
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york
5      puja   19      iran

In [ ]:
print(df["Name"])

0        sasi
1      tulasi
2     nandini
3    nagamani
4      sandya
5        puja
Name: Name, dtype: object

In [ ]:
print(df.shape)

(6, 3)

In [ ]:
print(df.describe())

             Age
count   6.000000
mean   24.833333
std     7.730890
min    18.000000
25%    19.500000
50%    22.000000
75%    28.250000
max    38.000000

In [ ]:
print(df[df["Age"]>20])

       Name  Age      City
0      sasi   21     india
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york

In [ ]:
print(df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

In [ ]:
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [ ]:
print(df.loc[0])

Name     sasi
Age        21
City    india
Name: 0, dtype: object

In [ ]:
print(df.loc[0:4])

       Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york

In [ ]:
print(df.isnull)

<bound method DataFrame.isnull of        Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york
5      puja   19      iran>

In [ ]:
print(df.duplicated)

<bound method DataFrame.duplicated of        Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york
5      puja   19      iran>

In [ ]:
print(df.fillna(0))

       Name  Age      City
0      sasi   21     india
1    tulasi   18   america
2   nandini   23    mexico
3  nagamani   38       usa
4    sandya   30  new york
5      puja   19      iran